<?php
session_start();

$countries = array("Российская Федерация", "Абхазия", "Австралия", "Австрия", "Азербайджан", "Азорские острова", "Аландские острова", "Албания", "Алжир", "Американское Самоа", "Ангилья", "Ангола", "Андорра", "Антигуа и Барбуда", "Антильские Острова (Нидерландские)", "Аомынь (Макао)", "Аргентина", "Армения", "Аруба", "Афганистан", "Багамские Острова", "Бангладеш", "Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", "Бенин", "Бермудские Острова", "Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Бруней", "Буркина-Фасо", "Бурунди", "Бутан", "Вазиристан", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Виргинские Острова", "Виргинские Острова", "Восточный Тимор", "Вьетнам", "Габон", "Гавайи", "Гаити", "Гайана", "Гамбия", "Гана", "Гваделупа", "Гватемала", "Гвиана", "Гвинея", "Гвинея-Бисау", "Германия", "Гернси", "Гибралтар", "Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания", "Джерси", "Джибути", "Доминика", "Доминиканская Республика", "Египет", "Замбия", "Западная Сахара", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Каймановы Острова", "Камбоджа", "Камерун", "Канада", "Канарские острова", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", "Кокосовые Острова", "Колумбия", "Коморские Острова", "Республика Конго", "Корея (Северная)", "Корея (Южная)", "Косово", "Коста-Рика", "Кот-д\'Ивуар", "Куба", "Кувейт", "Кука острова", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Мадейра (острова)", "Майотта", "Македония", "Малави", "Малайзия", "Мали", "Малые Тихоокеанские Острова США", "Мальдивы", "Мальта", "Марокко", "Мартиника", "Маршалловы Острова", "Мексика", "Мелилья", "Микронезия", "Мозамбик", "Молдавия", "Монако", "Монголия", "Монтсеррат", "Мьянма", "Мэн", "Нагорный Карабах (Арцах)", "Намибия", "Науру", "Непал", "Нигер", "Нигерия", "Нидерланды", "Никарагуа", "Ниуэ", "Новая Зеландия", "Новая Каледония", "Норвегия", "Норфолк", "Объединенные Арабские Эмираты", "Оман", "Пакистан", "Палау", "Палестина", "Панама", "Папуа", "Парагвай", "Перу", "Питкэрн", "Польша", "Португалия", "Приднестровье", "Пуэрто-Рико", "Реюньон", "Рождества Остров", "Руанда", "Румыния", "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томеи Принсипи", "Саудовская Аравия", "Свазиленд", "Свальбард", "Святой Елены Остров", "Северные Марианские острова", "Северный Кипр", "Сейшельские острова", "Сенегал", "Сен-Пьери Микелон", "Сент-Винсенти Гренадины", "Сент-Китси Невис", "Сент-Люсия", "Сербия", "Сеута", "Сингапур", "Сирия", "Словакия", "Словения", "Соединенные Штаты Америки — США", "Соломоновы Острова", "Сомали", "Сомалиленд", "Судан", "Суринам", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", "Тамил-Илам", "Танзания", "Тёркс и Кайкос", "Того", "Токелау", "Тонга", "Тринидад и Тобаго", "Тувалу", "Тунис", "Туркмения — Туркменистан", "Турция", "Уганда", "Узбекистан", "Украина", "Уоллиси Футуна", "Уругвай", "Фарерские Острова", "Фиджи", "Филиппины", "Финляндия", "Фолклендские Острова", "Франция", "Французская Полинезия", "Французские Южные Территории", "Хорватия", "Центральноафриканская Республика – ЦАР", "Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "Южная Георгия и Южные Сандвичевы острова", "Южная Осетия", "Южно-Африканская Республика (ЮАР)", "Ямайка", "Япония");
$sections = array("Секция 1: Селекция веществ молекулярно-кинетическими и аэродинамическими методами. Вопросы совершенствования технологии и техники разделительных производств",
    "Секция 2: Селекция веществ оптическими, электромагнитными, ИЦР, лазерными и плазменными методами. Диагностика и методы анализа веществ и примесей",
    "Секция 3: Плазменные техника и технологии в ядерно-топливном цикле",
    "Секция 4: Применение изотопов в фундаментальных, прикладных физико-химических исследованиях и медицине. Получение изотопно-модифицированных материалов",
    "Секция 5: Селекция и глубокая очистка трудно разделяемых веществ физико-химическими методами");

//Массив обязательных для заполнения полей на серверной стороне.
$fields = array("lastname" => "Фамилия", "firstname" => "Имя", "residence" => "Город", "organization" => "Организация", "email" => "E-mail", "thesesTitle" => "Название тезисов");
$all_fields = array(
    "lastname" => "Фамилия",
    "firstname" => "Имя",
    "middlename" => "Отчество",
    "status" => "Должность",
    "degree" => "Ученая степень",
    "country" => "Страна",
    "residence" => "Город",
    "organization" => "Организация",
    "organizationAddr" => "Адрес организации",
    "email" => "E-mail",
    "tel" => "Телефон",
    "section" => "Секция",
    "thesesTitle" => "Название тезисов",
    "thesesAttach" => "Прикрепить тезисы",
    "hotel" => "Необходимость в гостинице",
    "additionalInfo" => "Дополнительная информация для организаторов");
//Шаблон для проверки email
$pattern = "#^[A-z0-9_-]+@[A-z0-9_-]+\.([A-z0-9]{1,6}\.)?[a-z]{2,6}$#";

if ($_POST) {
    $error = false; // Флаг наличия ошибки в формате вводимых данных
    foreach ($_POST as $key => $value) {
        $value = trim($value);
        if (array_key_exists($key, $fields) && empty($value)) {
            $_SESSION['res']['error'] .= "Вы не заполнили поле {$fields[$key]}.<br>";
            $error = true;
        }
    }

    if (!empty($_POST['email'])) {
        if (!preg_match($pattern, $_POST['email'])) {
            $_SESSION['res']['error'] .= "Поле E-mail не соответствует формату. <br>";
            $error = true;
        }
    }

    if ($_POST['confirm'] != 'on') {
        $_SESSION['res']['error'] .= "Вы не подтвердили согласие на публикацию.";
        $error = true;
    } else {//Действия в случае правильного заполнения формы. Запись в БД.

//        Проверка полей на заполненность
        foreach ($_POST as $key => $value) {
            if (!array_key_exists($key, $all_fields)) continue;
            $value = trim($value);
            if (empty($value)) $value = "Поле не заполнено.";
            $body .= "{$all_fields[$key]}: \r\n{$value}\r\n\r\n";
        }

        echo '<pre>';
        var_dump($_POST);
        echo '<pre>';
        var_dump($_FILES);


        //        Запись участника в базу данных
        include("php/dbConnection.php");

        $sql = "INSERT INTO `article`(`idArticle`, `thesesTitle`, `thesesAttach`, `idScAdviser`, `idSection`)
                  VALUES (NULL ,'{$_POST['thesesTitle']}', '{$_POST['thesesAttach']}',
                  '{$_POST['idScAdviser']}', '{$_POST['section']}')";
        $db->execute($sql);

        $sql = "INSERT INTO `participant`(`idParticipant`, `lastname`, `firstname`, `middlename`,
                    `status`, `degree`, `country`, `residence`, `organization`, `organizationAddr`,
                    `email`, `tel`, `hotel`, `additionalInfo`, `idArticle`)
                    VALUES (NULL ,'{$_POST['lastname']}', '{$_POST['firstname']}', '{$_POST['middlename']}',
                    '{$_POST['status']}', '{$_POST['degree']}', '{$_POST['country']}',
                    '{$_POST['residence']}', '{$_POST['organization']}', '{$_POST['organizationAddr']}',
                    '{$_POST['email']}', '{$_POST['tel']}', '{$_POST['hotel']}',
                    '{$_POST['additionalInfo']}', LAST_INSERT_ID())";
        $db->execute($sql);

//        Формирование и отправка письма
        $to = "admin@site.lk, admin2@site.lk";
        $subject = "Заполнена форма участия в конференции. Сайт http://localhost:63342/conference.lk";
        $headers = "FROM: " . strtoupper($_SERVER['SERVER_NAME']) . "<>\r\n";
        $headers .= "Content-type:text/plain; charset=utf-8";

        if (mail($to, $subject, $body, $headers)) {
            $_SESSION['res']['ok'] = "Спасибо, Ваша заявка зарегистрирована.";
        } else {
            $_SESSION['res']['error'] .= "Ошибка при отправке письма.";
        }
    }

    if ($error) {
        foreach ($_POST as $key => $value) {
            $_SESSION['res'][$key] = trim($value);
        }
    }

    header("Location: {$_SERVER['PHP_SELF']}");
    exit;
}
